#+TITLE: Deploy scQTL browser
#+AUTHOR: Abhishek Sarkar
#+PROPERTY: header-args:sh :eval never-export :results output

* Test environment

  Get a local compute node.

  #+BEGIN_SRC sh :session midway2
    srun -n1 --partition=broadwl --pty bash
    cd /project2/mstephens/aksarkar/projects/singlecell-qtl/browser/
    source activate scqtl
  #+END_SRC

  #+RESULTS:
  : srun -n1 --partition=broadwl --pty ba sh
  : cd /project2/mstephens/aksarkar/projects/sing lecell-qtl/browser/
  : source activate scqtl

  (Re)start the browser

  #+BEGIN_SRC sh :session midway2
    pkill -u aksarkar bokeh
    bokeh serve qtls simulation --address $(hostname -i) --allow-websocket-origin=$(hostname -i):5006 &
    echo "http://$(hostname -i):5006"
  #+END_SRC

  #+RESULTS:
  : pkill -u aksarkar bokeh
  : Received signal 15, shutting down
  : (hostname -i) --allow-websocket-origin=$(hostname -i):5006
  : bokeh serve qtls simulation --address  $(hostname -i) --allow-websocket-origin=$(hostname -i):5006 &
  : [5] 54282
  : echo "http://$(hostname -i):5006"
  : echo 'org_babel_sh_eoe'
  : http://10.50.222.82:5006

* Production environment

  Start a remote session on ~shiny.stephenslab.uchicago.edu~.

  #+BEGIN_SRC sh :session shiny
  ssh shiny
  #+END_SRC

  #+RESULTS:
  #+begin_example

  Welcome to Ubuntu 18.04.1 LTS (GNU/Linux 4.15.0-33-generic x86_64)

   ,* Documentation:  https://help.ubuntu.com
   ,* Management:     https://landscape.canonical.com
   ,* Support:        https://ubuntu.com/advantage

    System information as of Tue Sep  4 13:49:02 CDT 2018

    System load:    0.08             Processes:              199
  of 1.79TB   Users logged in:        0
  IP address for enp3s0:  128.135.144.117
  IP address for docker0: 172.17.0.1

   ,* Read about Ubuntu updates for L1 Terminal Fault Vulnerabilities
     (L1TF).

     - https://ubu.one/L1TF

   ,* Check out 6 great IDEs now available on Ubuntu. There may even be
     something worthwhile there for those crazy EMACS fans ;)

     - https://bit.ly/6-cool-IDEs

   ,* Canonical Livepatch is available for installation.
     - Reduce system reboots and improve kernel security. Activate at:
       https://ubuntu.com/livepatch

  0 packages can be updated.
  0 updates are security updates.


  Last login: Tue Sep  4 11:07:44 2018 from 128.135.112.68
  #+end_example

  Add the Debian Stretch box using the full URL.

  #+BEGIN_SRC sh :session shiny
  vagrant box add --provider=virtualbox "https://app.vagrantup.com/debian/boxes/stretch64"
  #+END_SRC

  #+RESULTS:
  #+BEGIN_EXAMPLE
    ==> box: Loading metadata for box 'https://app.vagrantup.com/debian/boxes/stretch64'
    echo 'org_babel_sh_eoe'
    ==> box: Adding box 'debian/stretch64' (v9.5.0) for provider: virtualbox
        box: Downloading: https://vagrantcloud.com/debian/boxes/stretch64/versions/9.5.0/providers/virtualbox.box
    ==> box: Successfully added box 'debian/stretch64' (v9.5.0) for 'virtualbox'!
  #+END_EXAMPLE

  (Re)start the VM.

  #+BEGIN_SRC sh :session shiny :results output
  mkdir -p scqtl-browser
  cd scqtl-browser
  vagrant halt
  vagrant up --no-provision
  #+END_SRC

  #+RESULTS:
  #+begin_example

  aksarkar@shiny:~/scqtl-browser/scqtl-browser$ [1m==> default: Attempting graceful shutdown of VM...[0m
  [0mBringing machine 'default' up with 'virtualbox' provider...[0m
  default: Checking if box 'debian/stretch64' is up to date...[0m
  default: Clearing any previously set forwarded ports...[0m
  default: Clearing any previously set network interfaces...[0m
  default: Preparing network interfaces based on configuration...[0m
  [0m    default: Adapter 1: nat[0m
  default: Forwarding ports...[0m
  5007 (host) (adapter 1)[0m
  2222 (host) (adapter 1)[0m
  default: Running 'pre-boot' VM customizations...[0m
  default: Booting VM...[0m
  default: Waiting for machine to boot. This may take a few minutes...[0m
  [0m    default: SSH address: 127.0.0.1:2222[0m
  [0m    default: SSH username: vagrant[0m
  [0m    default: SSH auth method: private key[0m
  default: Machine booted and ready![0m
  default: Checking for guest additions in VM...[0m
  [0m    default: No guest additions were detected on the base box for this VM! Guest
      default: additions are required for forwarded ports, shared folders, host only
      default: networking, and more. If SSH fails on this machine, please install
      default: the guest additions and repackage the box to continue.
      default: 
      default: This is not an error message; everything may continue to work properly,
      default: in which case you may ignore this message.[0m
  default: Rsyncing folder: /home/aksarkar/scqtl-browser/ => /vagrant[0m
  default: Machine not provisioned because `--no-provision` is specified.[0m
  [0m[0m
  default: Machine 'default' has a post `vagrant up` message. This is a message
  default: from the creator of the Vagrantfile, and not from Vagrant itself:
  default:
  default: Vanilla Debian box. See https://app.vagrantup.com/debian for help and bug reports[0m
  #+end_example

  ssh into the VM.

  #+BEGIN_SRC sh :session shiny
  vagrant global-status
  #+END_SRC

  #+RESULTS:
  #+begin_example
  [0mid       [0m[0mname    [0m[0mprovider   [0m[0mstate   [0m[0mdirectory                           [0m[0m[0m
  [0m------------------------------------------------------------------------[0m
  [0m21c0820  [0m[0mdefault [0m[0mvirtualbox [0m[0mrunning [0m[0m/home/aksarkar/scqtl-browser        [0m[0m[0m
  [0m 
  The above shows information about all known Vagrant environments
  on this machine. This data is cached and may not be completely
  up-to-date. To interact with any of the machines, you can go to
  that directory and run Vagrant, or you can use the ID directly
  with Vagrant commands from any directory. For example:
  "vagrant destroy 1a2b3c4d"[0m
  #+end_example

  #+BEGIN_SRC sh :session shiny :results output
  vagrant ssh 21c0820
  #+END_SRC

  #+RESULTS:
  #+begin_example

  1 SMP Debian 4.9.110-3+deb9u2 (2018-08-13) x86_64

  The programs included with the Debian GNU/Linux system are free software;
  the exact distribution terms for each program are described in the
  individual files in /usr/share/doc/*/copyright.

  Debian GNU/Linux comes with ABSOLUTELY NO WARRANTY, to the extent
  permitted by applicable law.
  Last login: Tue Sep  4 18:50:59 2018 from 10.0.2.2
  #+end_example

  The data are available on the VM under ~/vagrant~. Fake the location of the
  database as it appears on the test server (~*.midway2.rcc.uchicago.edu~).

  #+BEGIN_SRC sh :session shiny
  sudo mkdir -p /project2/mstephens/aksarkar/projects/singlecell-qtl/
  sudo ln -s /vagrant /project2/mstephens/aksarkar/projects/singlecell-qtl/browser
  #+END_SRC

  #+RESULTS:

  Install ~miniconda3~ as user ~vagrant~.

  #+BEGIN_SRC sh :session shiny
  wget -q https://repo.continuum.io/miniconda/Miniconda3-latest-Linux-x86_64.sh
  bash Miniconda3-latest-Linux-x86_64.sh -b
  echo "export PATH=$PATH:$HOME/miniconda3/bin" >>$HOME/.bashrc
  . $HOME/.bashrc
  #+END_SRC

  #+RESULTS:
  #+begin_example

  PREFIX=/home/vagrant/miniconda3
  installing: python-3.6.5-hc3d631a_2 ...
  Python 3.6.5 :: Anaconda, Inc.
  installing: ca-certificates-2018.03.07-0 ...
  installing: conda-env-2.6.0-h36134e3_1 ...
  installing: libgcc-ng-7.2.0-hdf63c60_3 ...
  installing: libstdcxx-ng-7.2.0-hdf63c60_3 ...
  installing: libffi-3.2.1-hd88cf55_4 ...
  installing: ncurses-6.1-hf484d3e_0 ...
  installing: openssl-1.0.2o-h20670df_0 ...
  installing: tk-8.6.7-hc745277_3 ...
  installing: xz-5.2.4-h14c3975_4 ...
  installing: yaml-0.1.7-had09818_2 ...
  installing: zlib-1.2.11-ha838bed_2 ...
  installing: libedit-3.1.20170329-h6b74fdf_2 ...
  installing: readline-7.0-ha6073c6_4 ...
  installing: sqlite-3.23.1-he433501_0 ...
  installing: asn1crypto-0.24.0-py36_0 ...
  installing: certifi-2018.4.16-py36_0 ...
  installing: chardet-3.0.4-py36h0f667ec_1 ...
  installing: idna-2.6-py36h82fb2a8_1 ...
  installing: pycosat-0.6.3-py36h0a5515d_0 ...
  installing: pycparser-2.18-py36hf9f622e_1 ...
  installing: pysocks-1.6.8-py36_0 ...
  installing: ruamel_yaml-0.15.37-py36h14c3975_2 ...
  installing: six-1.11.0-py36h372c433_1 ...
  installing: cffi-1.11.5-py36h9745a5d_0 ...
  installing: setuptools-39.2.0-py36_0 ...
  installing: cryptography-2.2.2-py36h14c3975_0 ...
  installing: wheel-0.31.1-py36_0 ...
  installing: pip-10.0.1-py36_0 ...
  installing: pyopenssl-18.0.0-py36_0 ...
  installing: urllib3-1.22-py36hbe7ace6_0 ...
  installing: requests-2.18.4-py36he2e5f8d_1 ...
  installing: conda-4.5.4-py36_0 ...
  installation finished.
  #+end_example

  Initialize a new environment. We don't need the full environment from
  ~singlecell-qtl~.

  #+BEGIN_SRC sh :session shiny
  conda update -yn base conda
  conda create -yqn "scqtl-browser" numpy scipy pandas matplotlib bokeh=0.12.14
  #+END_SRC

  #+RESULTS:
  : usage: conda-env [-h] {attach,create,export,list,remove,upload,update} ...
  : conda-env: error: unrecognized arguments: scipy pandas matplotlib bokeh

  ~rsync~ the code and data to the server.

  #+BEGIN_SRC sh :dir /scratch/midway2/aksarkar/singlecell
  sbatch --partition=broadwl --job-name=rsync
  #!/bin/bash
  rsync -au /project2/mstephens/aksarkar/projects/singlecell-qtl/browser/ shiny:scqtl-browser/
  #+END_SRC

  #+RESULTS:
  : Submitted batch job 49170826

  Start the QTL browser. The code/data are available under ~/vagrant~ inside the VM.

  #+BEGIN_SRC sh :session shiny
  cd /vagrant
  source activate scqtl-browser
  nohup bokeh serve simulation qtls --port 5006 --allow-websocket-origin=shiny.stephenslab.uchicago.edu:5007 &
  #+END_SRC

  #+RESULTS:
  : cd /vagrant
  : source activate scqtl-browser
  : <-websocket-origin=shiny.stephenslab.uchicago.edu:5007 &
  : [1] 709
